class tokens:
    bot = "abcdef1234"
    discordbotlist = "abcdef1234"
    discordbotsgg = "abcdef1234"
    discordextremelist = "abcdef1234"
    topgg = "abcdef1234"

class bot:
    prefix = "c-"
    description = "cookies go brrrrrrrrrrrr"
    loading = "<a:loading:777504033925234718>"
    colour = 14200170
    timeout = 120
    spawn = 0
    spawnrate = 5
    support_server = "https://discord.gg/nvSwvPXgkn"
    countdown = [
"""
       ██████╗
       ╚════██╗
        █████╔╝
        ╚═══██╗
       ██████╔╝
       ╚═════╝
""",
"""
       ██████╗
       ╚════██╗
        █████╔╝
       ██╔═══╝
       ███████╗
       ╚══════╝
""",
"""
         ██╗
        ███║
        ╚██║
         ██║
         ██║
         ╚═╝
"""
    ],
    banner = """
╔═╗╔═╗╔═╗╦╔═╦╔═╗  ╔═╗╦╔═╗╦ ╦╔╦╗╔═╗╦═╗
║  ║ ║║ ║╠╩╗║║╣   ╠╣ ║║ ╦╠═╣ ║ ║╣ ╠╦╝
╚═╝╚═╝╚═╝╩ ╩╩╚═╝  ╚  ╩╚═╝╩ ╩ ╩ ╚═╝╩╚═
"""

class emojis:
    default = ["<:mc_cookie:726184620164382741>", "<:gocciola:747247300803297290>", "<:oreo:761274120821276702>"]
    default_cookie = "🍪"
    check = "<a:check:726040431539912744>"
    fail = "<a:fail:727212831782731796>"
    loading = "<a:loading:777504033925234718>"
